from unittest.mock import patch

import pandas as pd

from src.reports import biggest_expenses, spending_by_category


def test_spending_by_category_date_none(df_transactions):
    assert spending_by_category(df_transactions, 'Супермаркеты') == []


def test_spending_by_category_df_none():
    df = pd.DataFrame([])
    assert spending_by_category(df, 'Супермаркеты', '2020-02-12') == []


@patch('pandas.DataFrame.to_dict')
def test_spending_by_category_try(get_mock):
    get_mock.return_value = [
        {
            "Дата операции": "03.01.2018 15:55:21",
            "Дата платежа": "03.01.2018",
            "Номер карты": "*7123",
            "Статус": "OK",
            "Сумма операции": -105.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -105.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 2,
            "Категория": "Здоровье",
            "MCC": 0,
            "Описание": "OOO Balid",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 21.0
        },
        {
            "Дата операции": "03.01.2018 14:55:21",
            "Дата платежа": "05.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -21.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -21.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0.3,
            "Категория": "Красота",
            "MCC": 5977.0,
            "Описание": "OOO Balid",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 21.0
        },
        {
            "Дата операции": "01.01.2018 20:27:51",
            "Дата платежа": "04.01.2018",
            "Номер карты": "*7189",
            "Статус": "OK",
            "Сумма операции": -316.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -316.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 1.2,
            "Категория": "Красота",
            "MCC": 5977.0,
            "Описание": "OOO Balid",
            "Бонусы (включая кэшбэк)": 6,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 316.0
        },
        {
            "Дата операции": "01.01.2020 12:49:53",
            "Дата платежа": "01.01.2018",
            "Номер карты": None,
            "Статус": "OK",
            "Сумма операции": -3000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -3000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 5,
            "Категория": "Переводы",
            "MCC": 2.3,
            "Описание": "Линзомат ТЦ Юность",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 3000.0
        }
    ]

    assert spending_by_category(pd.DataFrame, "Здоровье", '2018-02-15') == [
                                                                            {
                                                                                "Дата операции": "03.01.2018 15:55:21",
                                                                                "Дата платежа": "03.01.2018",
                                                                                "Номер карты": "*7123",
                                                                                "Статус": "OK",
                                                                                "Сумма операции": -105.0,
                                                                                "Валюта операции": "RUB",
                                                                                "Сумма платежа": -105.0,
                                                                                "Валюта платежа": "RUB",
                                                                                "Кэшбэк": 2,
                                                                                "Категория": "Здоровье",
                                                                                "MCC": 0,
                                                                                "Описание": "OOO Balid",
                                                                                "Бонусы (включая кэшбэк)": 0,
                                                                                "Округление на инвесткопилку": 0,
                                                                                "Сумма операции с округлением": 21.0
                                                                            }
                                                                         ]
    get_mock.assert_called_once()


@patch('pandas.DataFrame.to_dict')
def test_biggest_expenses_try(get_mock):
    get_mock.return_value = [
        {
            "Дата операции": "03.01.2018 15:55:21",
            "Дата платежа": "03.01.2018",
            "Номер карты": "*7123",
            "Статус": "OK",
            "Сумма операции": -105.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -105.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 2,
            "Категория": "Здоровье",
            "MCC": 0,
            "Описание": "OOO Balid",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 21.0
        },
        {
            "Дата операции": "03.01.2018 14:55:21",
            "Дата платежа": "05.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -21.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -21.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0.3,
            "Категория": "Красота",
            "MCC": 5977.0,
            "Описание": "OOO Balid",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 21.0
        },
        {
            "Дата операции": "01.01.2018 20:27:51",
            "Дата платежа": "04.01.2018",
            "Номер карты": "*7189",
            "Статус": "OK",
            "Сумма операции": -316.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -316.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 1.2,
            "Категория": "Красота",
            "MCC": 5977.0,
            "Описание": "OOO Balid",
            "Бонусы (включая кэшбэк)": 6,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 316.0
        },
        {
            "Дата операции": "01.01.2020 12:49:53",
            "Дата платежа": "01.01.2018",
            "Номер карты": None,
            "Статус": "OK",
            "Сумма операции": -3000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -3000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 5,
            "Категория": "Переводы",
            "MCC": 2.3,
            "Описание": "Линзомат ТЦ Юность",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 3000.0
        }
    ]

    result = biggest_expenses(pd.DataFrame, 2018, 1)
    assert result == '[\n    {\n        "Красота": -337.0\n    },\n    {\n        "Здоровье": -105.0\n    }\n]'


def test_biggest_expenses_df_none():
    df = pd.DataFrame([])

    assert biggest_expenses(df, 2018, 1) == '[]'


def test_biggest_expenses_year_none(df_transactions):

    assert biggest_expenses(df_transactions, 0, 1) == '[]'


def test_biggest_expenses_month_none(df_transactions):

    assert biggest_expenses(df_transactions, 2018, 0) == '[]'
